# Taps
tap "homebrew/bundle"
tap "planetscale/tap"

# Brews
brew "awscli"
brew "bat"
brew "deno"
brew "exa"
brew "fnm"
brew "fzf"
brew "go"
brew "goreleaser"
brew "jq"
brew "mysql-client"
brew "starship"
brew "zoxide"
brew "planetscale/tap/pscale"

# Casks
cask "alacritty"
cask "boop"
cask "brave-browser"
cask "chromedriver"
cask "chromium"
cask "devtoys"
cask "docker"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "ngrok"
cask "postman"
cask "powershell"
cask "raycast"
cask "spotify"
cask "stats"
cask "typora"
cask "visual-studio-code"
